import { Typography } from "@mui/material"
import { makeStyles } from '@mui/styles';
import ReactReadMoreReadLess from "react-read-more-read-less";
import { useTheme } from '@mui/material/styles';
import useMediaQuery from '@mui/material/useMediaQuery';


const useStyles = makeStyles( theme =>({

    detail1Content: {
        marginTop: '1.6rem',
        background: '#fff',
        borderRadius: '.7rem',
        padding:'1rem',
        wordWrap: 'wrap',
        '& .react-read-more-read-less.react-read-more-read-less-more,.react-read-more-read-less.react-read-more-read-less-less':{
            display: 'flex',
            justifyContent: 'center',
            marginTop: '2rem !important',
            color: '#3f51b5',
            cursor: 'pointer',
        }
    },
    detaile : {
        lineHeight : '2'
    }

}))

export const Detaile2 = () =>{

    const classes = useStyles();
    const theme = useTheme();
    const matches = useMediaQuery(theme.breakpoints.down('sm'));

    const text = `
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و ینده شناخت فراوان جامعه آینده شناخت فراوان جامعه و متخصصان را می طلبد 
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و ینده شناخت فراوان جامعه آینده شناخت فراوان جامعه و متخصصان را می طلبد 
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و ینده شناخت فراوان جامعه آینده شناخت فراوان جامعه و متخصصان را می طلبد 
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و ینده شناخت فراوان جامعه آینده شناخت فراوان جامعه و متخصصان را می طلبد 
        د 
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و ینده شناخت فراوان جامعه آینده شناخت فراوان جامعه و متخصصان را می طلبد 
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و ینده شناخت فراوان جامعه آینده شناخت فراوان جامعه و متخصصان را می طلبد 
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و ینده شناخت فراوان جامعه آینده شناخت فراوان جامعه و متخصصان را می طلبد 
    
        `

    return(
        <div className={classes.detail1Content}>
            <ReactReadMoreReadLess
                charLimit={matches ? 150: 1100 }
                readMoreText={"Read more ▼"}
                readLessText={"Read less ▲"}
                readMoreStyle={{whiteSpace: "nowrap", textDecoration: "none", }}
            >
                {
                    text
                }
            
            </ReactReadMoreReadLess>
        </div>
    )
}